PinkFluffyUnic0rn/stm32flight/main.c
	float time;			// seconds passed from 00:00 UTC
	char date[10];			// date in format dd.mm.yy

	uint8_t lat;			// latitude
	float latmin;			// latitude minutes
	enum LATDIR latdir;		// latitude direction, 1 if
					// south, 0 if north

	uint8_t lon;			// longitude
	float lonmin;			// longitude minutes
	enum LONDIR londir;		// longitude direction, 1 if
					// west, 0 if east

	float magvar;			// magnetic declination in
					// degrees
	enum MAGVARDIR  magvardir;	// magnetic declination
					// direction, 0 if east, 1 if
					// west

	float speed;			// speed in knots
	float course;			// course toward north pole
					// in degrees
	float altitude;			// altitude in meters

	int quality;			// link quality
	uint8_t satellites;		// satellites count
};

// telemetry packet stored in onboard flash
struct logpack {
	float data[LOG_MAXPACKSIZE];
};

// stabilization modes short codes that is
// sent to eLRS remote inside telemetry packets
const char *attmodestr[] = {"ac", "st", "sp", "ps"};
const char *yawmodestr[] = {"sp", "cs"};
const char *altmodestr[] = {"tr", "cl", "al"};
const char *logfieldstr[LOG_FIELDSTRSIZE] = {
	"acc_x", "acc_y", "acc_z",
	"gyro_x", "gyro_y", "gyro_z",
	"mag_x", "mag_y", "mag_z",
	"bar_temp", "bar_alt",
	"roll", "pitch", "yaw",
	"climbrate", "alt",
	"lt", "lb", "rb", "rt",
	"bat", "cur",
	"ch0", "ch1", "ch2", "ch3", "ch4", "ch5", "ch6", "ch7",
	"ch8", "ch9", "ch10", "ch11", "ch12", "ch13", "ch14", "ch15"
};

// Flight controller board's devices drivers
struct cdevice dev[DEV_COUNT];
struct bdevice flashdev;

// DSP contexts
struct dsp_lpf batlpf;
struct dsp_lpf currlpf;

struct dsp_lpf valpf;
struct dsp_lpf tlpf;
struct dsp_lpf altlpf;

struct dsp_lpf accxpt1;
struct dsp_lpf accypt1;
struct dsp_lpf acczpt1;

struct dsp_lpf gyroxpt1;
struct dsp_lpf gyroypt1;
struct dsp_lpf gyrozpt1;

struct dsp_lpf magxlpf;
struct dsp_lpf magylpf;
struct dsp_lpf magzlpf;

struct dsp_compl pitchcompl;
struct dsp_compl rollcompl;
struct dsp_compl yawcompl;

struct dsp_compl climbratecompl;
struct dsp_compl altcompl;

struct dsp_pidval pitchpv;
struct dsp_pidval rollpv;
struct dsp_pidval pitchspv;
struct dsp_pidval rollspv;
struct dsp_pidval yawpv;
struct dsp_pidval yawspv;
struct dsp_pidval tpv;
struct dsp_pidval cpv;
struct dsp_pidval apv;

// Global storage for sensor data
// that aquired in separate events
float temp;
struct qmc_data qmcdata;
struct gnss_data  gnss;
struct crsf_tele tele;

// Control values
float thrust = 0.0; // motors basic thrust
float rolltarget = 0.0; // roll PID target
float pitchtarget = 0.0; // pitch PID target
float yawtarget = 0.0; // yaw PID target
float ltm = 1.0; // left-top motor thrust scaling
float lbm = 1.0; // left-bot motor thrust scaling
float rtm = 1.0; // right-top motor thrust scaling
float rbm = 1.0; // right-bot motor thrust scaling
float en = 0.0; // 1.0 when motors turned on, 0.0 otherwise
enum ALTMODE altmode = 0; // ALTMODE_POS if in altitude hold mode,
			  // ALTMODE_SPEED if climbrate control mode,
			  // ALTMODE_ACCEL if acceleration control mode
int speedpid = 0;	// 1 if only gyroscope if used for yaw
			// stabilization, 0 if accelerometer is used
int yawspeedpid = 0;	// 1 if only gyroscope if used for yaw
			// stabilization, 0 if magnetometer is used

int magcalibmode = 0; // 1 when magnetometer calibration mode
		      // is enabled, 0 otherwise
int elrs = 0; // 1 when ELRS control is active (ELRS remote's channel 8
	      // is > 50)

// Pressure and altitude initial values
float alt0 = 0.0;

// Current settings slot
int curslot = 0;

// Settings
struct settings st;

// Timer events
struct timev evs[TEV_COUNT];

// Stabilization loops counter
int loops = 0;

// Stabilization loops performed in last second
int loopscount = 0;

// Timeout counter for the ELRS reciver. Set to ELRS_TIMEOUT after
// receiving useful packet from receiver and decreased by 1 every
// second. If it falls to 0, quadcopter disarms.
int elrstimeout = ELRS_TIMEOUT;

// emergency disarm triggered, further
// arming is possible only after reboot
int emergencydisarm = 0;

// Log bufferization controlling variables
int logbufpos = 0;
int logflashpos = 0;
size_t logsize = 0;
float logbuf[LOG_BUFSIZE / sizeof(float)];

// external interrupt callback. It calls interrupt hadlers from
// drivers for devices that use external interrupts.
void HAL_GPIO_EXTI_Callback(uint16_t pin)
{
	if (DEVITENABLED(dev[ESP_DEV].status))
		dev[ESP_DEV].interrupt(dev[ESP_DEV].priv, &pin);
}

// UART receive callback. It calls interrupt handlers from
// drivers for devices working through UART.
//
// huart -- context for UART triggered that callback.
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	if (DEVITENABLED(dev[M10_DEV].status))
		dev[M10_DEV].interrupt(dev[M10_DEV].priv, huart);

	if (DEVITENABLED(dev[CRSF_DEV].status))
		dev[CRSF_DEV].interrupt(dev[CRSF_DEV].priv, huart);

	if (DEVITENABLED(dev[UART_DEV].status))
		dev[UART_DEV].interrupt(dev[UART_DEV].priv, huart);
}

// UART error callback. Calls UART error handlers from
// drivers for devices working through UART.
//
// huart -- context for UART triggered that callback.
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
	if (DEVITENABLED(dev[ESP_DEV].status))
		dev[ESP_DEV].error(dev[ESP_DEV].priv, huart);
}

// Get battery voltage from ADC.
//
// hadc -- ADC context.
float batteryvoltage()
{
	uint32_t v;

	HAL_ADC_Start(&hadc1);
	HAL_ADC_PollForConversion(&hadc1, 1);

	v = HAL_ADC_GetValue(&hadc1);

	HAL_ADC_Stop(&hadc1);

	return (v / (float) 0xfff * 17.85882);
}

// Get esc current from ADC.
//
// hadc -- ADC context.
float esccurrent()
{
	uint32_t v;

	HAL_ADC_Start(&hadc2);
	HAL_ADC_PollForConversion(&hadc2, 1);

	v = HAL_ADC_GetValue(&hadc2);

	HAL_ADC_Stop(&hadc2);

	return (v / (float) 0xfff);
}

int logfieldstrn(const char *s)
{
	int i;

	for (i = 0; i < LOG_FIELDSTRSIZE; ++i) {
		if (strcmp(s, logfieldstr[i]) == 0)
			break;
	}
	
	if (i >= LOG_FIELDSTRSIZE)
		return (-1);

	return i;
}

