PinkFluffyUnic0rn/stm32flight/main.c
	d.gyroscale = ICM_1000DPS;
	d.gyrorate = ICM_GYRO8K;
	d.gyroorder = ICM_GYROORDER3;
	d.gyrolpf = ICM_GYROLPFLL;
	d.accelscale = ICM_4G;
	d.accelrate = ICM_ACCEL8K;
	d.accellpf = ICM_ACCELLPFLL;
	d.accelorder = ICM_ACCELORDER3;

	if (icm_initdevice(&d, dev + ICM_DEV) >= 0)
		uartprintf("ICM-42688 initilized\r\n");
	else
		uartprintf("failed to initilize ICM-42688\r\n");
}

// Init QMC5883L magnetometer.
static void qmc_init()
{
	struct qmc_device d;

	d.hi2c = &hi2c1;
	d.scale = QMC_SCALE_8;
	d.rate = QMC_RATE_100;
	d.osr = QMC_OSR_512;

	if (qmc_initdevice(&d, dev + QMC_DEV) >= 0)
		uartprintf("QMC5883L initilized\r\n");
	else
		uartprintf("failed to initilize QMC5883L\r\n");
}

// Init ESP8285.
static void espdev_init()
{
	struct esp_device d;

	d.hspi = &hspi2;
	d.csgpio = GPIOC;
	d.cspin = GPIO_PIN_0;
	d.rstgpio = GPIOC;
	d.rstpin = GPIO_PIN_14;
	d.bootgpio = GPIOC;
	d.bootpin = GPIO_PIN_15;
	d.busygpio = GPIOB;
	d.busypin = GPIO_PIN_15;
	d.intpin = GPIO_PIN_1;

	if (esp_initdevice(&d, dev + ESP_DEV) < 0) {
		uartprintf("failed to initilize ESP8266\r\n");
		return;
	}

	uartprintf("ESP8266 initilized\r\n");
}

// Init ERLS receiver driver.
static void crsfdev_init()
{
	struct crsf_device d;

	d.huart = &huart2;

	crsf_initdevice(&d, dev + CRSF_DEV);
}

// Init W25Q onboard flash memory.
static void w25dev_init()
{
	struct w25_device d;

	d.hspi = &hspi1;
	d.gpio = GPIOB;
	d.pin = GPIO_PIN_3;

	if (w25_initdevice(&d, &flashdev) < 0) {
		uartprintf("failed to initilize W25Q\r\n");
		return;
	}

	uartprintf("W25Q initilized\r\n");
}

// Init GNSS module.
static void m10dev_init()
{
	struct m10_device d;

	d.huart = &huart3;

	if (m10_initdevice(&d, dev + M10_DEV) < 0) {
		uartprintf("failed to initilize GPS device\r\n");
		return;
	}

	uartprintf("GPS device initilized\r\n");
}

// Init UART config connection.
static void uartdev_init()
{
	struct uart_device d;

	d.huart = &huart4;

	if (uart_initdevice(&d, dev + UART_DEV) < 0) {
		uartprintf("failed to initilize UART device\r\n");
		return;
	}

	uartprintf("UART device initilized\r\n");
}

// write quadcopter settings into internal MCU flash.
//
// slot -- offset in settings array in flash.
int writesettings(int slot)
{
	struct settings s[6];
	uint32_t sz;
	uint32_t *pt;
	uint32_t addr;
	int j;

	memcpy(s, (void *) (USER_FLASH), sizeof(struct settings) * 6);

	__disable_irq();
	HAL_FLASH_Unlock();

	FLASH_Erase_Sector(FLASH_SECTOR_11,  VOLTAGE_RANGE_3);

	memcpy(s + slot, &st, sizeof(struct settings));

	sz = sizeof(struct settings) * 6;
	pt = (uint32_t *) s;
	
	addr = USER_FLASH;
	for (j = 0; j < sz / 4; ++j) {
		HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, addr, pt[j]);
		addr += 4;
	}

	HAL_FLASH_Lock();
	__enable_irq();

	return 0;
}

// Validate current settings. Reset settings
// that has wrong values to default
int validatesettings()
{
	int i;

	if (!irc_ispowervalid(st.ircpower))
		st.ircpower = IRC_POWER_25;
	if (!irc_isfreqvalid(st.ircpower))
		st.ircfreq = IRC_FREQ_5733;

	if (st.lt < 0 || st.lt > 3)	st.lt = 0;
	if (st.lb < 0 || st.lb > 3)	st.lb = 1;
	if (st.rb < 0 || st.rb > 3)	st.rb = 2;
	if (st.rt < 0 || st.rt > 3)	st.rt = 3;

	if (st.logfreq < 0 || st.logfreq > 4096)
		st.logfreq = 128;

	if (st.logpacksize < 0 || st.logpacksize > LOG_MAXPACKSIZE)
		st.logpacksize = 0;

	for (i = 0; i < LOG_FIELDSTRSIZE; ++i) {
		if (st.fieldid[i] < 0)
			st.fieldid[i] = 0xff;
	}

	return 0;
}

// Read setting from internal MCU flash.
//
// slot -- offset in settings array in flash.
int readsettings(int slot)
{
	memcpy(&st, (void *) (USER_FLASH
			+ slot * sizeof(struct settings)),
		sizeof(struct settings));

	validatesettings();

	return 0;
}

// Init/set stabilization loop.
//
// init -- if called during initilization.
int setstabilize(int init)
{
	// init complementary filters contexts
	dsp_setcompl(&pitchcompl, st.atctcoef, PID_FREQ, init);
	dsp_setcompl(&rollcompl, st.atctcoef, PID_FREQ, init);
	dsp_setcompl(&yawcompl, st.yctcoef, PID_FREQ, init);

	dsp_setcompl(&climbratecompl, st.cctcoef, HP_FREQ, init);
	dsp_setcompl(&altcompl, st.actcoef, HP_FREQ, init);

	// init roll and pitch position PID controller contexts
	dsp_setpid(&pitchpv, st.p, st.i, st.d, st.dpt1freq,
		PID_FREQ, init);
	dsp_setpid(&rollpv, st.p, st.i, st.d, st.dpt1freq,
		PID_FREQ, init);

	// init roll, pitch and yaw speed PID controller contexts
	dsp_setpid(&pitchspv, st.sp, st.si, st.sd,
		st.dpt1freq, PID_FREQ, init);
	dsp_setpid(&rollspv, st.sp, st.si, st.sd,
		st.dpt1freq, PID_FREQ, init);
	dsp_setpid(&yawspv, st.ysp, st.ysi, st.ysd,
		st.dpt1freq, PID_FREQ, init);

	// init yaw position PID controller's context
	dsp_setpid(&yawpv, st.yp, st.yi, st.yd, st.dpt1freq,
		PID_FREQ, init);

	// init vertical acceleration PID controller's context
	dsp_setpid(&tpv, st.zsp, st.zsi, st.zsd, st.dpt1freq,
		PID_FREQ, init);

	// init climbrate PID controller's context
	dsp_setpid(&cpv, st.cp, st.ci, st.cd, st.dpt1freq,
		PID_FREQ, init);

	// init altitude PID controller's context
	dsp_setpid(&apv, st.ap, st.ai, st.ad, st.dpt1freq,
		PID_FREQ, init);

	// init battery voltage low-pass filter
	dsp_setlpf1f(&batlpf, 100.0, POWER_FREQ, init);
	dsp_setlpf1f(&currlpf, 100.0, POWER_FREQ, init);

	// init low-pass fitlers for altitude and vertical acceleration
	dsp_setlpf1t(&altlpf, st.atcoef, HP_FREQ, init);
	dsp_setlpf1t(&tlpf, st.ttcoef, PID_FREQ, init);
	dsp_setlpf1t(&valpf, st.vatcoef, PID_FREQ, init);

	// init low-pass fitlers for accelerometer x, y and z axes
	dsp_setlpf1f(&accxpt1, st.accpt1freq, PID_FREQ, init);
	dsp_setlpf1f(&accypt1, st.accpt1freq, PID_FREQ, init);
	dsp_setlpf1f(&acczpt1, st.accpt1freq, PID_FREQ, init);

	// init low-pass fitlers for gyroscope x, y and z axes
	dsp_setlpf1f(&gyroxpt1, st.gyropt1freq, PID_FREQ, init);
	dsp_setlpf1f(&gyroypt1, st.gyropt1freq, PID_FREQ, init);
	dsp_setlpf1f(&gyrozpt1, st.gyropt1freq, PID_FREQ, init);

