PinkFluffyUnic0rn/stm32flight/main.c
	return 0;
}

// "lpf" command handler. Configure low-pass filters.
//
// dev -- charter device device that got this command.
// toks -- list of parsed command tokens.
// out -- command's output.
int lpfcmd(const struct cdevice *dev, const char **toks, char *out)
{
	if (strcmp(toks[1], "gyro") == 0) {
		st.gyropt1freq = atof(toks[2]);

		dsp_setlpf1f(&gyroxpt1, st.gyropt1freq, PID_FREQ, 0);
		dsp_setlpf1f(&gyroypt1, st.gyropt1freq, PID_FREQ, 0);
		dsp_setlpf1f(&gyroypt1, st.gyropt1freq, PID_FREQ, 0);
	}
	else if (strcmp(toks[1], "accel") == 0) {
		st.accpt1freq = atof(toks[2]);

		dsp_setlpf1f(&accxpt1, st.accpt1freq, PID_FREQ, 0);
		dsp_setlpf1f(&accypt1, st.accpt1freq, PID_FREQ, 0);
		dsp_setlpf1f(&accypt1, st.accpt1freq, PID_FREQ, 0);
	}
	else if (strcmp(toks[1], "d") == 0) {
		st.dpt1freq = atof(toks[2]);
		
		dsp_setpid(&pitchpv, st.p, st.i, st.d,
			st.dpt1freq, PID_FREQ, 0);
		dsp_setpid(&rollpv, st.p, st.i, st.d,
			st.dpt1freq, PID_FREQ, 0);
		dsp_setpid(&pitchspv, st.sp, st.si, st.sd,
			st.dpt1freq, PID_FREQ, 0);
		dsp_setpid(&rollspv, st.sp, st.si, st.sd,
			st.dpt1freq, PID_FREQ, 0);
		dsp_setpid(&yawspv, st.ysp, st.ysi, st.ysd,
			st.dpt1freq, PID_FREQ, 0);
		dsp_setpid(&yawpv, st.yp, st.yi, st.yd,
			st.dpt1freq, PID_FREQ, 0);
		dsp_setpid(&tpv, st.zsp, st.zsi, st.zsd,
			st.dpt1freq, PID_FREQ, 0);
		dsp_setpid(&cpv, st.cp, st.ci, st.cd,
			st.dpt1freq, PID_FREQ, 0);
	}
	else if (strcmp(toks[1], "climb") == 0) {
		st.ttcoef = atof(toks[2]);

		dsp_setlpf1t(&tlpf, st.ttcoef, PID_FREQ, 0);
	}
	else if (strcmp(toks[1], "vaccel") == 0) {
		st.vatcoef = atof(toks[2]);

		dsp_setlpf1t(&valpf, st.vatcoef, PID_FREQ, 0);
	}
	else if (strcmp(toks[1], "altitude") == 0) {
		st.atcoef = atof(toks[2]);

		dsp_setlpf1t(&altlpf, st.atcoef, HP_FREQ, 0);
	}
	else
		return (-1);

	return 0;
}

// "adj" command handler. Configure various offset/scale values.
//
// dev -- charter device device that got this command.
// toks -- list of parsed command tokens.
// out -- command's output.
int adjcmd(const struct cdevice *dev, const char **toks, char *out)
{
	float v;

	v = atof(toks[2]);

	if (strcmp(toks[1], "rollthrust") == 0)		st.rsc = v;
	else if (strcmp(toks[1], "pitchthrust") == 0)	st.psc = v;
	else if (strcmp(toks[1], "roll") == 0)		st.roll0 = v;
	else if (strcmp(toks[1], "pitch") == 0)		st.pitch0 = v;
	else if (strcmp(toks[1], "yaw") == 0)		st.yaw0 = v;
	else if (strcmp(toks[1], "acc") == 0) {
		if (strcmp(toks[2], "x") == 0)
			st.ax0 = atof(toks[3]);
		else if (strcmp(toks[2], "y") == 0)
			st.ay0 = atof(toks[3]);
		else if (strcmp(toks[2], "z") == 0)
			st.az0 = atof(toks[3]);
		else
			return (-1);
	}
	else if (strcmp(toks[1], "gyro") == 0) {
		if (strcmp(toks[2], "x") == 0)
			st.gx0 = atof(toks[3]);
		else if (strcmp(toks[2], "y") == 0)
			st.gy0 = atof(toks[3]);
		else if (strcmp(toks[2], "z") == 0)
			st.gz0 = atof(toks[3]);
		else
			return (-1);
	}
	else if (strcmp(toks[1], "mag") == 0) {
		if (strcmp(toks[2], "x0") == 0)
			st.mx0 = atof(toks[3]);
		else if (strcmp(toks[2], "y0") == 0)
			st.my0 = atof(toks[3]);
		else if (strcmp(toks[2], "z0") == 0)
			st.mz0 = atof(toks[3]);
		else if (strcmp(toks[2], "xscale") == 0)
			st.mxsc = atof(toks[3]);
		else if (strcmp(toks[2], "yscale") == 0)
			st.mysc = atof(toks[3]);
		else if (strcmp(toks[2], "zscale") == 0)
			st.mzsc = atof(toks[3]);
		else if (strcmp(toks[2], "decl") == 0)
			st.magdecl = atof(toks[3]);
		else
			return (-1);
	}
	else
		return (-1);

	return 0;
}

// "log" command handler. Start/stop/get flight log.
//
// d -- charter device device that got this command.
// toks -- list of parsed command tokens.
// out -- command's output.
int logcmd(const struct cdevice *d, const char **toks, char *out)
{
	char s[INFOLEN];

	if (strcmp(toks[1], "set") == 0) {
		// flash erasing process takes time and blocks
		// other actions, so disarm for safety
		en = 0.0;
		setthrust(0.0, 0.0, 0.0, 0.0);

		// notify user when erasing is started
		sprintf(s, "erasing flash...\r\n");
		d->write(d->priv, s, strlen(s));

		logsize = atoi(toks[2]) * sizeof(float)
			* st.logpacksize;

		// set log size (0 is valid and
		// means to disable logging)
		if (logsize > W25_TOTALSIZE)
			return (-1);

		// erase log flash no
		// respond during this process
		eraseflash(d, logsize);

		// enable writeonly mode if log writing is enabled
		flashdev.ioctl(flashdev.priv,
			(logsize == 0)
			? W25_IOCTL_READWRITE : W25_IOCTL_WRITEONLY);

		// notify user when telemetry flash is erased
		sprintf(s,"erased %u bytes of flash\r\n", logsize);
		d->write(d->priv, s, strlen(s));

		// enable telemetry
		logflashpos = 0;
		logbufpos = 0;
	}
	else if (strcmp(toks[1], "rget") == 0) {
		// enable read/write mode if reading log
		flashdev.ioctl(flashdev.priv, W25_IOCTL_READWRITE);

		// print records from specified range
		if (printlog(d, s, atoi(toks[2]), atoi(toks[3])) < 0)
			return (-1);

		// write end marker
		sprintf(s, "-end-\r\n");
		d->write(d->priv, s, strlen(s));
	}
	else if (strcmp(toks[1], "bget") == 0) {
		const char **p;

		// enable read/write mode if reading log
		flashdev.ioctl(flashdev.priv, W25_IOCTL_READWRITE);
	
		// print every record whose number is in arguments
		for (p = toks + 2; strlen(*p) != 0; ++p) {
			if (printlog(d, s, atoi(*p), atoi(*p) + 1) < 0)
				return (-1);
		}

		// write end marker
		sprintf(s, "-end-\r\n");
		d->write(d->priv, s, strlen(s));
	}
	else if (strcmp(toks[1], "freq") == 0) {
		st.logfreq = atoi(toks[2]);

		if (st.logfreq < 0 || st.logfreq > 4096)
			st.logfreq = 128;

		modifytimev(evs + TEV_LOG, st.logfreq);

		return 0;
	}
	else if (strcmp(toks[1], "record") == 0) {
		if (strcmp(toks[2], "size") == 0) {
			unsigned int p;

			for (p = 1; p < atoi(toks[3]); p <<= 1);

			if (p > LOG_MAXPACKSIZE)
				p = LOG_MAXPACKSIZE;

			st.logpacksize = p;
		}
		else {
			int strn;

