PinkFluffyUnic0rn/stm32flight/main.c
			strn = logfieldstrn(toks[2]);

			if (strn < 0)
				return (-1);

			st.fieldid[strn] = atoi(toks[3]);
		}
		
		return 0;
	}
	else
		return (-1);

	return 1;
}


// "ctrl" command handler. Configure control ranges scaling.
//
// d -- charter device device that got this command.
// toks -- list of parsed command tokens.
// out -- command's output.
int ctrlcmd(const struct cdevice *d, const char **toks, char *out)
{
	float v;

	v = atof(toks[2]);

	if (strcmp(toks[1], "thrust") == 0)
		st.thrustmax = v;
	else if (strcmp(toks[1], "roll") == 0)
		st.rollmax = v;
	else if (strcmp(toks[1], "pitch") == 0)
		st.pitchmax = v;
	else if (strcmp(toks[1], "yaw") == 0)
		st.yawtargetspeed = v;
	else if (strcmp(toks[1], "sroll") == 0)
		st.rollspeed = v;
	else if (strcmp(toks[1], "spitch") == 0)
		st.pitchspeed = v;
	else if (strcmp(toks[1], "syaw") == 0)
		st.yawspeed = v;
	else if (strcmp(toks[1], "accel") == 0)
		st.accelmax = v;
	else if (strcmp(toks[1], "climbrate") == 0)
		st.climbratemax = v;
	else if (strcmp(toks[1], "altmax") == 0)
		st.altmax = v;
	else
		return (-1);

	return 0;
}

// "system" command handler. Run system commands.
//
// d -- charter device device that got this command.
// toks -- list of parsed command tokens.
// out -- command's output.
int systemcmd(const struct cdevice *d, const char **toks, char *out)
{
	if (strcmp(toks[1], "esp") == 0) {
		if (strcmp(toks[2], "flash") == 0)
			dev[ESP_DEV].configure(dev[ESP_DEV].priv, "flash");
		else if (strcmp(toks[2], "run") == 0)
			dev[ESP_DEV].configure(dev[ESP_DEV].priv, "run");
		else
			return (-1);
	}
	else
		return (-1);

	return 0;
}

// "irc" command handler. Configure IRC tramp video transmitter.
//
// d -- charter device device that got this command.
// toks -- list of parsed command tokens.
// out -- command's output.
int irccmd(const struct cdevice *d, const char **toks, char *out)
{
	if (strcmp(toks[1], "frequency") == 0) {
		st.ircfreq = atoi(toks[2]);

		if (dev[IRC_DEV].status != DEVSTATUS_INIT)
			return 0;

		dev[IRC_DEV].configure(dev[IRC_DEV].priv, "set",
			"frequency", atoi(toks[2]));
	}
	else if (strcmp(toks[1], "power") == 0) {
		st.ircpower = atoi(toks[2]);
	
		if (dev[IRC_DEV].status != DEVSTATUS_INIT)
			return 0;

		dev[IRC_DEV].configure(dev[IRC_DEV].priv, "set",
			"power", atoi(toks[2]));
	}
	else
		return (-1);

	return 0;
}

// "motor" command handler. Configure motors output
// number and direction.
//
// d -- charter device device that got this command.
// toks -- list of parsed command tokens.
// out -- command's output.
int motorcmd(const struct cdevice *d, const char **toks, char *out)
{
	if (strcmp(toks[1], "lt") == 0) {
		if (strcmp(toks[2], "r") == 0)
			dshotcmd(st.lt, 21);
		else if (strcmp(toks[2], "d") == 0)
			dshotcmd(st.lt, 20);
		else if (strcmp(toks[2], "s") == 0) {
			dshotcmd(st.lt, 12);
			mdelay(35);
		}
		else
			st.lt = atoi(toks[2]);
	}
	else if (strcmp(toks[1], "lb") == 0) {
		if (strcmp(toks[2], "r") == 0)
			dshotcmd(st.lb, 21);
		else if (strcmp(toks[2], "d") == 0)
			dshotcmd(st.lb, 20);
		else if (strcmp(toks[2], "s") == 0) {
			dshotcmd(st.lb, 12);
			mdelay(35);
		}
		else
			st.lb = atoi(toks[2]);
	}
	else if (strcmp(toks[1], "rb") == 0) {
		if (strcmp(toks[2], "r") == 0)
			dshotcmd(st.rb, 21);
		else if (strcmp(toks[2], "d") == 0)
			dshotcmd(st.rb, 20);
		else if (strcmp(toks[2], "s") == 0) {
			dshotcmd(st.rb, 12);
			mdelay(35);
		}
		else
			st.rb = atoi(toks[2]);
	}
	else if (strcmp(toks[1], "rt") == 0) {
		if (strcmp(toks[2], "r") == 0)
			dshotcmd(st.rt, 21);
		else if (strcmp(toks[2], "d") == 0)
			dshotcmd(st.rt, 20);
		else if (strcmp(toks[2], "s") == 0) {
			dshotcmd(st.rt, 12);
			mdelay(35);
		}
		else
			st.rt = atoi(toks[2]);
	}
	else
		return (-1);

	return 0;
}

// "get" command handler. Get current configuration values.
//
// d -- charter device device that got this command.
// toks -- list of parsed command tokens.
// out -- command's output.
int getcmd(const struct cdevice *d, const char **toks, char *out)
{
	const char **p;
	char *data;
	int isfloat;
	float v;
	int vi;

	isfloat = 1;

	if (strcmp(toks[1], "pid") == 0) {
		if (strcmp(toks[2], "tilt") == 0) {
			if (strcmp(toks[3], "p") == 0)
				v = st.p;
			else if (strcmp(toks[3], "i") == 0)
				v = st.i;
			else if (strcmp(toks[3], "d") == 0)
				v = st.d;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "stilt") == 0) {
			if (strcmp(toks[3], "p") == 0)
				v = st.sp;
			else if (strcmp(toks[3], "i") == 0)
				v = st.si;
			else if (strcmp(toks[3], "d") == 0)
				v = st.sd;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "yaw") == 0) {
			if (strcmp(toks[3], "p") == 0)
				v = st.yp;
			else if (strcmp(toks[3], "i") == 0)
				v = st.yi;
			else if (strcmp(toks[3], "d") == 0)
				v = st.yd;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "syaw") == 0) {
			if (strcmp(toks[3], "p") == 0)
				v = st.ysp;
			else if (strcmp(toks[3], "i") == 0)
				v = st.ysi;
			else if (strcmp(toks[3], "d") == 0)
				v = st.ysd;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "throttle") == 0) {
			if (strcmp(toks[3], "p") == 0)
				v = st.zsp;
			else if (strcmp(toks[3], "i") == 0)
				v = st.zsi;
			else if (strcmp(toks[3], "d") == 0)
				v = st.zsd;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "climbrate") == 0) {
			if (strcmp(toks[3], "p") == 0)
				v = st.cp;
			else if (strcmp(toks[3], "i") == 0)
				v = st.ci;
			else if (strcmp(toks[3], "d") == 0)
				v = st.cd;
			else
				return (-1);
		}
		else if (strcmp(toks[2], "altitude") == 0) {
			if (strcmp(toks[3], "p") == 0)
				v = st.ap;
			else if (strcmp(toks[3], "i") == 0)
				v = st.ai;
			else if (strcmp(toks[3], "d") == 0)
				v = st.ad;
			else
				return (-1);
		}
		else
			return (-1);
	
